Revit 2027 API
ParameterTypeId.ViewportAttrShowBox Property
 "Show Box"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportAttrShowBox { get; }
Public Shared ReadOnly Property ViewportAttrShowBox As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportAttrShowBox {
	ForgeTypeId^ get ();
}
static member ViewportAttrShowBox : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace